S16-x2-wVanLeer-hisa-maxCo5-chamfer-Euler/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs (
   "libcompressibleTurbulenceModels.so"
   "libfindroot.so"
   "libhisaFiniteVolume.so"
   "libvelocityOutletNSCBCx.so" 
   "libpressureOutletNSCBC.so"
   "libtemperatureOutletNSCBC.so"
);
application     hisa;

startFrom    latestTime;

startTime    0;

stopAt    endTime;

endTime    0.1;

deltaT    1.0e-7;

writeControl    adjustableRunTime;

writeInterval    0.5e-4;

purgeWrite    0;

writeFormat    binary;

writePrecision   6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable    true;

adjustTimeStep  yes;

maxCo    5;

maxDeltaT       1e-5;

functions
{
    #include "FOMachNo"
    #include "FOvorticity"
//    #include "FOyPlus"
    #includeFunc "writeCellCentres"
//    #includeFunc "wallShearStress"
//    #include "FOMachAveInlet"
//    #include "FOMachAveOutlet"
//   #include "FOforces"
//    #include "FOpressure"
//    #include "FOsurfaceSample"
//    #include "FOIDDES"
/*    fieldAverage
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

        );
    }
*/
}


// ************************************************************************* //
